tap "chipsalliance/verible"

brew "gh"
brew "neovim"
brew "python@3"
brew "tmux"
brew "tree"
brew "uv"
brew "yt-dlp"
brew "ffmpeg"
brew "chipsalliance/verible/verible"

brew codex 
brew copilot-cli

cask "ghostty"
cask "drawio"
cask "gitx"
cask "macvim-app"
cask "vlc"
cask "claude"


cask "font-victor-mono"

vscode "bmpenuelas.waveform-render"
vscode "chipsalliance.verible"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "ms-python.debugpy"
vscode "ms-python.pylint"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-server"
vscode "mshr-h.veriloghdl"
vscode "shopify.ruby-lsp"
vscode "vscodevim.vim"
